---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarElemBarSpacing
source: html/704145d8-fdd2-59d6-874c-29c8bf5e2d28.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarElemBarSpacing Property

"Spacing"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarElemBarSpacing { get; }
```